Azuralz/Azuralz/Stm32Project/10-5MAX7219模块/Hardware/MYSPI.c
#include "stm32f10x.h"                  // Device header


void MYSPI_W_SS(uint8_t Bitvalue)
{
	GPIO_WriteBit(GPIOA, GPIO_Pin_4, (BitAction)Bitvalue);
}

void MYSPI_W_SCK(uint8_t Bitvalue)
{
	GPIO_WriteBit(GPIOA, GPIO_Pin_5, (BitAction)Bitvalue);
}

void MYSPI_W_MOSI(uint8_t Bitvalue)
{
	GPIO_WriteBit(GPIOA, GPIO_Pin_7, (BitAction)Bitvalue);
}

uint8_t MYSPI_R_MISO(void)
{
	return GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_6);
}

void MYSPI_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	MYSPI_W_SS(1);
	MYSPI_W_SCK(0);
}

void MYSPI_Start(void)
{
	MYSPI_W_SS(0);
}

void MYSPI_Stop(void)
{
	MYSPI_W_SS(1);
}

uint8_t MYSPI_SwapByte(uint8_t SendByte)
{
	uint8_t i;
	for(i = 0; i < 8; i++)
	{
		MYSPI_W_MOSI(SendByte & 0x80);
		SendByte <<= 1;
		MYSPI_W_SCK(1);
		if(MYSPI_R_MISO() == 1){SendByte |= 0x01;}
		MYSPI_W_SCK(0);
	}
	return SendByte;
}





